---
type: DWGImportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# DWGImportOptions

`Autodesk.Revit.DB.DWGImportOptions` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DWGImportOptions | — | `` |
| Constructor | DWGImportOptions | 2013 | `public DWGImportOptions ()` |
| Method | GetLineWeights | 2013 | `public IList < int > GetLineWeights ()` |
| Method | SetLineWeights | 2013 | `public void SetLineWeights ( IList < int > lineWeight )` |